Update User and Developer Guides
